app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = ? AND "tasks"."state" = 'to_do'  [["user_id", 1]]
---
  def index
    @to_do = current_user.tasks.where(state: "to_do")

INSERT INTO "tasks" ("content", "content_html", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "hej"], ["content_html", "<p>hej</p>"], ["created_at", "2015-03-13 05:10:22.264298"], ["updated_at", "2015-03-13 05:10:22.264298"], ["user_id", 1]]
---
  def create
    @task = current_user.tasks.new(task_params)
    @task.save

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = 4  [["state", "doing"], ["updated_at", "2015-02-15 04:55:37.663827"]]
---
  def update
    @task.update(task_params)

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = 6  [["state", "doing"], ["updated_at", "2015-02-17 06:11:14.167768"]]
---
  def change
    @task.update_attributes(state: params[:state])